In [1]:
import pandas as pd
import numpy as np
import os

# step 3

In [2]:
path = r'/Users/tayen/Documents/CF/Instacart Basket Analysis/02 Data'

In [3]:
df_ords_prods_comb = pd.read_pickle(os.path.join(path,'Prepared Data','orders_products_combined.pkl'))

# step 4

In [4]:
df_ords_prods_comb.shape

(32434489, 12)

# step 5

In [5]:
df_prods = pd.read_csv(os.path.join(path,'Prepared Data','prods_processed.csv'))

In [6]:
df_prods.shape

(49672, 6)

In [7]:
df_prods.head(5)

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [8]:
df_ords_prods_comb.head(5)

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [9]:
df_ords_prods_comb.rename(columns = {'_merge':'_merge1'},inplace = True)

In [10]:
df_merged = df_ords_prods_comb.merge(df_prods, on = 'product_id', indicator = True)

In [11]:
df_merged.head()

,Unnamed: 0.1,Unnamed: 0_x,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge1,Unnamed: 0_y,product_name,aisle_id,department_id,prices,_merge
0,0,0,2539329,1,1,2,8,NaN,196,1,0,both,195,Soda,77,7,9.0,both
1,1,1,2398795,1,2,3,7,15.0,196,1,1,both,195,Soda,77,7,9.0,both
2,2,2,473747,1,3,3,12,21.0,196,1,1,both,195,Soda,77,7,9.0,both
3,3,3,2254736,1,4,4,7,29.0,196,1,1,both,195,Soda,77,7,9.0,both
4,4,4,431534,1,5,4,15,28.0,196,1,1,both,195,Soda,77,7,9.0,both

# step 6

In [12]:
df_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [13]:
df_merged.shape

(32404859, 18)

# step 7

In [14]:
df_orders_products_merged = df_merged.drop(['Unnamed: 0.1','Unnamed: 0_x','Unnamed: 0_y'],axis = 1)

In [15]:
df_orders_products_merged.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge1,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,both,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,both,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,both,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,both,Soda,77,7,9.0,both

In [16]:
df_orders_products_merged.shape

(32404859, 15)

In [18]:
df_orders_products_merged.to_pickle(os.path.join(path,'Prepared Data','orders_products_merged.pickle'))